# Циклы while и for. Вложенные циклы. Работа со списками. Списки и циклы
# Таблица умножений
# i = 1
# while i < 10:
#     j = 0
#     while j < 10:
#         print(f"{i} * {j} = {i * j}", end = '\t')
#         j += 1
#     print(end = "\n")
#     i += 1

# ============================================================================

# row = int(input("Введите количество строк: "))
# column = int(input("Введите количество столбцов: "))
#
# Упрощонный вариант
# print(('^' * column + '\n') * row)

# i = 0
# while i < row:
#     j = 0
#     while j < column:
#         print('^', end = '')
#         j += 1
#     print()
#     i += 1

# ==========================================================================

# row = int(input("Введите количество строк: "))
# column = int(input("Введите количество столбцов: "))
#
# i = 0
# while i < row:
#     j = 0
#     while j < column:
#         symbol = '+' if i % 2 == 0 else '-'
#         print(symbol, end = '')
#         j += 1
#     print()
#     i += 1

# ==========================================================================

# num = int(input("Введите колтчество желаемых символов: "))
#
# i = 0
# while i < num:
#     print(' ' * i + '*')
#     i += 1

# ===========================================================================

# for i in range(3):
#     print('^' * 6)

# ===========================================================================

number = int(input("Введите число: "))

nums = [i for i in range(1, number // 2 + 1) if number % i == 0]
print(nums)

